[
    {
        "title": "The amazing, robust framework with unlimited scalability earns its #1 status",
        "name": "Srinivasan Kuppuswamy",
        "pros": "\"The accounting module's record and report process is closely integrated with almost every other process. \"",
        "cons": "\"The solution is not ready for the current e-commerce environment. \""
    },
    {
        "title": "Excellent and straightforward solution with great optimization capabilities",
        "name": "Desmond Festus",
        "pros": "\"The implementation is very straightforward.\"",
        "cons": "\"The system is over-customized.\""
    },
    {
        "title": "The solution connects to every software but it's not 100% stable",
        "name": "JavedKhan1",
        "pros": "\"The product connects to every software.\"",
        "cons": "\"The service could be more user-friendly in the area of transition codes.\""
    },
    {
        "title": "Provides full integration and automates workflows",
        "name": "Patrick Posch",
        "pros": "\"The best feature of SAP ERP is the full integration.\"",
        "cons": "\"The solution's graphical user interface (GUI) is outdated and could be improved.\""
    },
    {
        "title": "Provides many interfaces, which allows you to build satellites around it with other SAP or third-party solutions",
        "name": "Olaf Dölz",
        "pros": "\"There are many interfaces, so you really can build satellites around it like with other SAP stuff or even third-party stuff. \"",
        "cons": "\"If big companies are going for SAP and they would like to install it, they should know that it still needs time. Implementation will cost a lot of money.\""
    },
    {
        "title": "A highly scalable and stable tool to improve business processes",
        "name": "VishalChopra",
        "pros": "\"SAP ERP's interface is pretty easy nowadays, as it has evolved over time and has been made as user-friendly as a person would like it.\"",
        "cons": "\"SAP ERP's initial setup phase needs to be simplified.\""
    },
    {
        "title": "A tool that offers multiple modules for enterprise resource planning along with great integration capabilities",
        "name": "Sameer Ghewade",
        "pros": "\"SAP ERP is one of the most well-integrated solutions with all of the applications in my company, making it one of the most advantageous traits of the product.\"",
        "cons": "\"Though SAP ERP's FICO module is a strong part of the product, its integration capabilities can be made stronger.\""
    },
    {
        "title": "A solution designed to provide a stable and superior experience in terms of the functionalities it offers to its users",
        "name": "Githinji Githogora",
        "pros": "\"It is a stable solution...Our company has experienced a return on investment using the solution.\"",
        "cons": "\"Presently, the solution's interface is not intuitive.\""
    },
    {
        "title": "Has specific codes that can help to access certain functions",
        "name": "Kanchan Khubnani",
        "pros": "\"The solution has made the most significant impact on our human resources function, specifically in HR operations and HR analytics. One feature of SAP ERP that I found most valuable is its use of codes for accessing specific functions.\r\n\r\n\"",
        "cons": "\"The product can be a little slow when dealing with thousands of employee data.\r\n\r\n\""
    },
    {
        "title": "A unified ERP that helps migrate data from various ERP systems",
        "name": "TomášZelina",
        "pros": "\"The valuable feature of SAP ERP is that everything is connected and under one roof, creating a unified system.\"",
        "cons": "\"I believe there's room for improvement in terms of user experience.\""
    },
    {
        "title": "Handles administrative tasks efficiently, but the system could be more intuitive",
        "name": "Lucjan Stalmach",
        "pros": "\" The system's reliability has supported our day-to-day operations effectively without significant interruptions.\"",
        "cons": "\"The product is less intuitive and cumbersome for certain tasks.\""
    },
    {
        "title": "The solution helps plan resources and execute deals",
        "name": "David Kunc",
        "pros": "\"I like the solution's ability to close plans and resource requirements in deals.\"",
        "cons": "\"SAP ERP was not very user-friendly.\""
    },
    {
        "title": "Easy to use and expand with helpful support",
        "name": "Sara Sara",
        "pros": "\"It has been quite stable so far. \"",
        "cons": "\"The only feature that is not available in our current version is web access.\""
    },
    {
        "title": "A stable and scalable solution that provides a high level of integration",
        "name": "Friedhelm Lefting",
        "pros": "\"The solution provides a high level of integration.\"",
        "cons": "\"The production system must be upgraded.\""
    },
    {
        "title": "Numerous solutions suitable for any company",
        "name": "Mariia Gondal",
        "pros": "\"SAP is more reliable in terms of data quality than other systems.\"",
        "cons": "\"Sometimes the cost is not reasonable, such as in the case of budgeting.\""
    },
    {
        "title": "A good solution for standardizing across processes but customizations are expensive",
        "name": "reviewer1996392",
        "pros": "\"The solution can easily be standardized across processes. \"",
        "cons": "\"Customizations are a bit expensive. \""
    },
    {
        "title": "Scales well and the claim management feature is useful",
        "name": "Christophe VANDEWEGHE",
        "pros": "\"The most valuable features are the claim management. \"",
        "cons": "\"There are a lot of manual tasks that are used by a lot of people, so it is a very good candidate for RPA.\""
    },
    {
        "title": "Helpful system integrations, flexible, and high availability",
        "name": "Harish Golla",
        "pros": "\"The most valuable features of SAP ERP is the flexibility and functionality. It is one of the best ERPs I have seen in the market.\"",
        "cons": "\"The reporting feature could improve in SAP ERP. It could benefit from being more flexible.\""
    },
    {
        "title": "Strong reporting, visibility, and performance",
        "name": "SEAN Justine",
        "pros": "\"The most significant elements of this solution are the ability to create a virtual product, a service product, and delivery.\"",
        "cons": "\"The problem with SAP is that whenever there is a modification, or if a new field needs to be added, they charge tens of thousands, hundreds, or even two hundred thousand dollars. That is not anything in which I am really interested. \r\n\r\nFor instance, consider a single-use case. I have to enter the root causes for a certain operation or failure. That option does not exist anywhere in SAP, not in manufacturing, not in logistics, not in anything. It is completely missing.\r\n\r\nThe root cause analysis is very common across industries, yet SAP does not offer this option.\r\n\r\nA line field or a metaparticle, for example, was delayed. If you have the choice to input the warehouse operator or if the person who submitted the document has the opportunity to enter, this has been postponed for N, X, Y, or Z reasons.\""
    },
    {
        "title": "Useful integration, helpful support, and plenty of modules",
        "name": "Mohamed Nabih",
        "pros": "\"The most valuable features of SAP ERP are the integration between all departments, such as purchasing, finance, trading, and sales.\"",
        "cons": "\"The initial setup of SAP ERP is complex and it took a lot of time.\""
    },
    {
        "title": "Comprehensive, perfect for utility service providers, and capable of scaling up to meet the needs of large organizations",
        "name": "Ra456it",
        "pros": "\"It is a utility-focused solution, and the deployment is very much aligned with utility service providers. If you look at the supply chain and the overall business model of a utility service provider, SAP is something that fits very well. That's because the company has invested tremendously in creating appropriate workflows pertaining to this segment or domain.\"",
        "cons": "\"It could always be cheaper. There is no doubt about it.\""
    },
    {
        "title": "Simple to use, but could benefit from having a bit more diversity added to it",
        "name": "Mustapha Sedki Ben Romdhane",
        "pros": "\"The features are very useful for finance.\"",
        "cons": "\"In previous generations, SAP was stable and the roadmap was very predictable, but currently it's very difficult.\""
    },
    {
        "title": "Useful features for financial management but technical support could be better",
        "name": "AjayKumar7",
        "pros": "\"It is an integrated application, and it has been working really well. Earlier, there were different companies for different applications for manufacturing, finance controlling, logistics, and quality. It probably was the first fully integrated application. Whenever somebody is entering any data, for example, invoice data or ordering data, everyone with a right to see this data can see it in the system.\"",
        "cons": "\"We will not make any major changes, and we are not expecting any enhancements or new features from SAP because they already have a new solution. No development is happening on SAP ERP because SAP has come up with a new version called SAP S/4HANA, which is memory-based technology. We are planning to upgrade to SAP S/4HANA, but we don't know when it will happen. We are in the preparation phase.\""
    },
    {
        "title": "Fully-integrated, very stable, and works well",
        "name": "reviewer1585932",
        "pros": "\"The most valuable features of SAP ERP are its stability, industry-specific package, and adaptable configuration.\r\n\"",
        "cons": "\"It is on the expensive side.\""
    },
    {
        "title": "Helps with finances, accounting, and reporting while making our internal processes run smoothly",
        "name": "Michael  Liu",
        "pros": "\"SAP ERP provides the perfect database and options for additional production. It's also good for finance analytics, production drill-down, and other types of analysis.\r\n\r\n\"",
        "cons": "\"The reporting could be improved, such as the casework, production, and activity reports. Our consultants in a subsidiary enterprise have requested that we develop a new production report. They could also improve production, financial, and HR analysis. \r\n\r\n\""
    },
    {
        "title": "It's good for finance analytics, production drill-down, and other types of analysis",
        "name": "Neno Lazarov",
        "pros": "\"The payroll solution and the localization for advances are valuable.\"",
        "cons": "\"It is not easily integrated with outside products.\""
    },
    {
        "title": "Great localization features, but is not easily integrated with outside products",
        "name": "Razan Dimashkieh",
        "pros": "\"It is easier to migrate to SAP ERP from a legacy system. We have different products for data services, and it is easier to migrate to SAP ERP as compared to other solutions. \r\n\r\nStability is one of the main features of SAP. What makes SAP ERP better than others is that SAP has taken into consideration the business processes of different industries, such as manufacturing. They have done the research, and they know what are the best practices. They have already implemented these best practices in SAP ERP, which are readily available for a client. Clients can also customize it based on their individual needs.\"",
        "cons": "\"Their support should be improved. Instead of giving a general solution, their consultants should first try to understand the problem and then resolve the same. They should properly investigate the issue before providing the solution.\""
    },
    {
        "title": "Easy to migrate from legacy systems, caters to business processes of different industries, and very stable and scalable",
        "name": "reviewer1414839",
        "pros": "\"This product is very scalable and easy to expand.\"",
        "cons": "\"Technical support is an area that is in need of improvement.\""
    },
    {
        "title": "Feature-rich, quite stable, and excels at finance management",
        "name": "Azzedine Allouache",
        "pros": "\"The most valuable feature of SAP ERP is the financial module, pre-configured packages, and plenty of features. The solution is updating and adding new features that are helpful.\"",
        "cons": "\"When there is a system error it provides an error code and a lot of times these can be complicated. The support team could have more knowledge to be able to assist with these situations more promptly.\""
    },
    {
        "title": "Beneficial financial module, useful pre-reconfigured setup, and simple setup",
        "name": "Wael Elsagh",
        "pros": "\"I have found all the modules related to finance valuable, such as account management and HR. The entire suite is very useful.\"",
        "cons": "\"When evaluating the current version I am using now, the SAP GUI is old-style and needs to be replaced with something more modern and easy to use. However, the SAP GUI is very optimized for connection networks and is extremely good. Many people would like to have a WebGUI or something else to have access in a different way. Additionally, there could be some drag and drop functionality added because these features are normally in any website that this solution does not have.\""
    },
    {
        "title": "Overall good functionality, beneficial financial modules, and highly stable",
        "name": "Mauro  Del Quondam",
        "pros": "\"It is a stable solution. \"",
        "cons": "\"The solution's UI could be better.\""
    },
    {
        "title": "It is a scalable solution and adapts to different business requirements",
        "name": "PrateekBansal",
        "pros": "\"I like the solution’s features in finance, supply chain, sales, and distribution.\"",
        "cons": "\"I would like to see more integration with other partners. Some of our customers already use specific or in-house applications for their business processes. They do not want to replace those applications.\""
    },
    {
        "title": "A complete business solution that is continuously transforming and innovating",
        "name": "ImranHasware",
        "pros": "\"Everyone who uses SAP ERP has benefited from the functionality.\"",
        "cons": "\"I would like to see the customization of the reports become easier to work with instead of having technical support have to assist us. \""
    },
    {
        "title": "Big business speciality, with excellent stability, and seasoned functionality",
        "name": "Mohit V",
        "pros": "\"The Material Management and Sales and Distribution modules are great. The Financial Accounting module is also great.  \"",
        "cons": "\"It should be less complex. It should also have better integration capability. I am using the ACC version, and in this version, the integration and the communication are very difficult and complicated.\""
    },
    {
        "title": "Has many modules, and is useful for all business processes",
        "name": "Shady Mogawer",
        "pros": "\"The solution is quite scalable. \"",
        "cons": "\"It's very difficult to find people who are well versed in it. \""
    },
    {
        "title": "A great all-in-one product that can scale and is stable",
        "name": "Neeraj Jain",
        "pros": "\"Its customer support is highly rated, and the technical support provided by SAP is considered very good.\"",
        "cons": "\"The initial setup was challenging initially. People did not understand much about what SAP could do.\""
    },
    {
        "title": "Improved financial controls with robust support and supply chain focus",
        "name": "reviewer1338723",
        "pros": "\"The product’s most valuable feature is a centralized system integrating different departments within the organization.\"",
        "cons": "\"They need to improve a few processes, including transformation, intelligence, governance, modeling, etc.\""
    },
    {
        "title": "Stable product with a centralized and well-integrated system",
        "name": "NarendraKumar2",
        "pros": "\"From a long-term perspective, I can say that the solution can offer a return on investment, but it may take around three to four years for our company to experience it.\"",
        "cons": "\"SAP ERP needs to consider simplifying a few areas within the tool. Compared to SAP ERP, other solutions in the market are much more easily configurable and understandable. SAP has a lot of complex features. \""
    },
    {
        "title": "Though a tool considered to have the ability to offer an entire package, it needs to be made more simpler",
        "name": "reviewer2302884",
        "pros": "\"SAP ERP offers a wide range of functional modules, including payroll, HR, financials, and others.\"",
        "cons": "\"Implementing SAP ERP can be very costly, particularly for smaller organizations with limited resources.\""
    },
    {
        "title": "Comprehensive functionality but complex implementation lifecycle",
        "name": "reviewer1834797",
        "pros": "\"Continuing to use it enabled continuity of business.\"",
        "cons": "\"SAP needs to be more intuitive.\""
    },
    {
        "title": "Enables continuity in our company but needs to be more intuitive",
        "name": "reviewer1759518",
        "pros": "\"SAP is not making a big effort to make it easy to integrate solutions from other vendors. It's not easy at all... Integration is what they can do better.\"",
        "cons": "\"The tool can be very much customized.\""
    },
    {
        "title": "Significantly reduces the time required to produce our financial reports",
        "name": "CSD174561",
        "pros": "\"I think we have not seen any tangible benefits from SAP ERP.\"",
        "cons": "\"Finance view across functions is valuable.\""
    },
    {
        "title": "Users have to deal with a complex setup phase",
        "name": "reviewer2506776",
        "pros": "\"Poor ergonomics.\"",
        "cons": "\"The solution is very mature.\""
    },
    {
        "title": "ECC has poor ergonomics. Finance view across functions is valuable, and the platform facilitates the automation of transactional processes",
        "name": "Jean-Luc Farion",
        "pros": "\"The user interface isn't as nice as SAP HANA's.\"",
        "cons": "\"The solution is very stable.\""
    },
    {
        "title": "Very mature with good procurement and payment processing aspects",
        "name": "Usman Saleem",
        "pros": "\"There is room for improvement in the integration of the solution, especially in the payroll area. \"",
        "cons": "\"The most valuable feature of SAP ERP is the integration. It can be seamlessly integrated across the board.\""
    },
    {
        "title": "An ERP solution used in the finance and logistics area with Universal Journal feature",
        "name": "PedroJimenez",
        "pros": "\"The user interface can be more intuitive and user-friendly by having it be more menu-driven, this would be a large benefit.\"",
        "cons": "\"The transactional integration of operations is the best-recommended feature of this product. It provides integration of all operational modules.\""
    },
    {
        "title": "Seamless integration, plenty of features, but support could improve",
        "name": "RajPatnaik",
        "pros": "\"The version that we are using lacks in reporting. The reporting feature needs to be constructed more in this product.\r\n\r\nThere can be better scope for mobility. They could include the technical development of reports instead of depending completely on programming. The programming method needs to be easy.\"",
        "cons": "\"We like that we have real-time dashboard views.\""
    },
    {
        "title": "Best for transactional integration of operations, but lacks in reporting",
        "name": "Murugesh Vellu",
        "pros": "\"I do not have any notes for improvements. \"",
        "cons": "\"The solution provides good production planning.\""
    },
    {
        "title": "Reliable and well-organized with helpful dashboards",
        "name": "Numair Mazhar",
        "pros": "\"Could be more user friendly. \"",
        "cons": "\"The solution has far more features, processes, and functionalities than we previously had. \""
    },
    {
        "title": "Offers very good production planning features and regular updates",
        "name": "Anshuman Bansal",
        "pros": "\"Functionality could be improved. \"",
        "cons": "\"The best thing that SAP ERP has is the extensive coverage of processes for every field and business unit such as procurement, inventory, financials, asset management, plant maintenance, and production. We can cover up to 99.9% processes of our organization, which is the best thing about this solution. \r\n\r\nIt also has a very good capability to integrate with other applications. The security and authorization level of SAP ERP is very high. No other solution can match this level.\""
    },
    {
        "title": "Provides great features, processes, and functionalities; offers a lot of customization",
        "name": "Jesús Antonio Santos Giraldo",
        "pros": "\"One thing that is lacking in ERP is a good user interface. It is currently very clumsy and complex. Another thing is that reporting capability of SAP ERP is customizable, but it is not very good. \r\n\r\nIts development time is also very high if you require specialized technical services. If you want to do any changes to the report or develop a new report, you need people with specialized skills. Business processes are very straightforward and standardized as per the industry standards. However, the way it works is a bit complex, and you need to know a lot of things. There are different things that can be complex for a general user. A lot of information is being provided in ERP. A general user doesn't require all this information, and it creates a lot of confusion. Its learning curve is very high.\"",
        "cons": "\"This is a robust solution with a lot of control measures.\""
    },
    {
        "title": "Extensive coverage of processes, good integrations, good security, and good stability",
        "name": "Prashant.Sharma",
        "pros": "\"I think that implementation could be simplified. \"",
        "cons": "\"The stability is SAP ERP is not good only because the version is old. They could work on improving the versions.\""
    },
    {
        "title": "Very robust with great asset management feature",
        "name": "Alaba Ayotunde O. OLUWAYIMIKA",
        "pros": "\"There should be better support provided to be able to migrate to S/4HANA easier.\"",
        "cons": "\"The stability and performance are good.\""
    },
    {
        "title": "Large scale deployment, but out of date",
        "name": "reviewer1307565",
        "pros": "\"The initial setup is complex. \"",
        "cons": "\"It is the best solution in the class of ERP products.\""
    },
    {
        "title": "Flexible with lots of great configuration capabilities and easy to scale",
        "name": "Shahzad-Islam",
        "pros": "\"The product does not update budgeting based on exchange rates which is important for BPM.\"",
        "cons": "\"I like SAP's premade workflows for various areas, such as supply chain, procurement, or finance. \""
    },
    {
        "title": "This is the best solution of this kind but has weakness in budget planning for certain user groups",
        "name": "Najva Mahdzadeh",
        "pros": "\"The user interface could be improved. For example, sometimes you're missing some data and can't complete a task. There should be some built-in support and suggestions on how to solve your problem. I would also like the interface to be optimized to work better with mobile devices like tablets and smartphones. \r\n\"",
        "cons": "\"It is a comprehensive and robust solution. It can provide lots of functional features. \""
    },
    {
        "title": "I like the solution's premade workflows",
        "name": "reviewer1955337",
        "pros": "\"In general, a user should attend training before they can use this platform. There's definitely a learning curve. As a new user or employee, there may be some difficulty with onboarding.\"",
        "cons": "\"Well-integrated multilingual technology. \""
    },
    {
        "title": "Comprehensive and robust with good scalability",
        "name": "Samuel Hon",
        "pros": "\"Lacks sufficient technical support with slow response times. \"",
        "cons": "\"The most valuable features of SAP ERP are that its robust, user-friendly, and secure.\""
    },
    {
        "title": "It standardizes processes. Employee/manager self-service could be improved.",
        "name": "it_user520524",
        "pros": "\"SAP ERP could improve by having better integration with other platforms.\"",
        "cons": "\"The most valuable features of SAP ERP are the general operations. It has a good way to manage a business and do financial reporting. Overall we are happy with the robustness of the solution.\r\n\""
    },
    {
        "title": "Offers very well integrated technology but the technical support is lacking",
        "name": "Manish Chhatbar",
        "pros": "\"Reporting is why most companies need to acquire business intelligence add-on solutions, and when it comes to SAP ERP, they could improve the reporting graphical representation of the data.\"",
        "cons": "\"Control and governance are the best features.\""
    },
    {
        "title": "Robust, secure, and user-friendly",
        "name": "Shivdatt Patel",
        "pros": "\" Pricing could be improved for preferred customers.\"",
        "cons": "\"The most valuable feature is the robust workflows that SAP provides to us in our organization. Overall, I find it the best ERP solution compared to other similar solutions.\""
    },
    {
        "title": "Effective business management, beneficial reports, but difficult to scale",
        "name": "reviewer1635108",
        "pros": "\"The problem for us, we are one company that has seven home markets. Argentina, Brazil, Chile, Colombia, Ecuador, and Peru. When we need to configure, modify rules, change policies, or taxes rules, when we move currencies around based on our other financial results, it can get very complicated. When we try to join everything together we have some problems. However, the process good, all of our material and procurement processes are going well. The problem is trying to consolidate the financial reports and this is where I have problems.\"",
        "cons": "\"Their tech support is always good. \""
    },
    {
        "title": "Control and governance are great features",
        "name": "reviewer1415319",
        "pros": "\"SAP ERP is scalable. We have some five to ten thousand SAP ERP users. \"",
        "cons": "\"They provide a full service. \""
    },
    {
        "title": "Robust workflows and overall operates well",
        "name": "reviewer1619403",
        "pros": "\"SAP is more expensive than some of its competitors.\"",
        "cons": "\"The solution is scalable.\""
    },
    {
        "title": "Stable solution; great tech support",
        "name": "reviewer1552263",
        "pros": "\"The warehouse management could be better.\"",
        "cons": "\"It provides one overview of the capacity planning.\""
    },
    {
        "title": "Has support that is quick to respond",
        "name": "Nam Doan",
        "pros": "\"It needs to incorporate the new features from the SAP S/4HANA release, such as, utilizing data processes, which is quite nice.\"",
        "cons": "\"The new Visual Enterprise functionalities give an intuitive approach to data and make communication between engineering and production easy.\""
    },
    {
        "title": "Real time end-to-end transactions is invaluable. UI needs improvement.",
        "name": "it_user138537",
        "pros": "\"Improvements to the UI. The UI is pretty old, but this will change with the upcoming release of S.4.​\"",
        "cons": "\"It has a lot of integrity of data, and it is fast. All the users feel that they can trust this data. So, data integrity is the most important value of SAP.\""
    },
    {
        "title": "Great at maintaining and deploying queries and internal controls",
        "name": "MARTIN BAÑALES",
        "pros": "\"It is not flexible for the users. SAP works in a specific way, and the users and the processes have to adapt to the way it works. It is hard to customize it to the level that we need for our work. It is not easy to get new extensions for process functions, modules, or activities.\"",
        "cons": "\"It's a good ERP system.\""
    },
    {
        "title": "It provides one overview of the capacity planning but it needs to incorporate more S/4HANA features",
        "name": "reviewer1000005",
        "pros": "\"The speed to build and the speed to deliver could be better.\"",
        "cons": "\"The power of ABAP Development Tools is the main valuable feature in the SAP ECC system. Every couple of years SAP upgrades ABAP technology significantly, which facilitates developers' work.\""
    },
    {
        "title": "The new Visual Enterprise functionalities give an intuitive approach to data",
        "name": "it_user849102",
        "pros": "\"The power of ABAP Development Tools is the main valuable feature in the SAP ECC system. Every couple of years SAP upgrades ABAP technology significantly, which facilitates developers' work.\"",
        "cons": "\"It gives us full control over each change, to the level of the individual field in a master record, including certificates.\""
    },
    {
        "title": "We're now able to do deep costing analyses, although initial setup was complex.",
        "name": "it_user311268",
        "pros": "\"The UI could use improvement.\"",
        "cons": "\"I like that SAP ERP is very robust and stable.\""
    },
    {
        "title": "Fast, 100% stable, and good data integrity",
        "name": "reviewer1045770",
        "pros": "\"It could be more flexible, and the company should be able to adapt the system. Not the other way around. It's very rigid and difficult to change. Reporting could also be better.\"",
        "cons": "\"SAP ERP has a good user interface with a lot of functionalities and good interface options.\""
    },
    {
        "title": "Reliable, scalable, but the agility needs improvement",
        "name": "reviewer1542249",
        "pros": "\"It would also help if it were more open, more flexible, with more standard products.\"",
        "cons": "\"The architecture of the solution overall is great. It's great for development, testing, and production. I've worked with solutions where the architecture wasn't as strong and it was a disaster.\""
    },
    {
        "title": "Consolidates multiple back-office systems into one platform with a single database",
        "name": "Eliram Yakar",
        "pros": "\"The system is very big. It is not exactly user-friendly, due to the fact that it's so massive and complex.\"",
        "cons": "\"It integrates everything into one process.\""
    },
    {
        "title": "Gives us full control over changes, to the level of individual fields in a master record",
        "name": "it_user868626",
        "pros": "\"There will always be something within our business that it won't fit.\"",
        "cons": "\"The initial setup was straightforward.\""
    },
    {
        "title": "It was complex to set-up as there was a lot of data conversion involved​ however it has created a paperless environment",
        "name": "it_user177144",
        "pros": "\"It has a high cost. \r\n\"",
        "cons": "\"SAP has provided a much more integrated platform for managing our manufacturing business.\""
    },
    {
        "title": "A robust and stable enterprise resource planning software, but it could be more flexible",
        "name": "reviewer1549338",
        "pros": "\"This solution could be made more user-friendly for development teams.\"",
        "cons": "\"Good customization features.\""
    },
    {
        "title": "A stable ERP solution with a good user interface and a lot of functionalities",
        "name": "reviewer1467861",
        "pros": "\"License fees are too high.\"",
        "cons": "\"The system can be integrated with other SAP functionalities - such as finance, production, sales, marketing, HR, et cetera, and can also be customized to become a model that's specifically designed for my business. That's the solution's most valuable aspect.\""
    },
    {
        "title": "Very stable with great integration capabilities and has a reliable architecture",
        "name": "it_user881271",
        "pros": "\"The solution is quite expensive. They need to work on the pricing to make it more reasonable.\"",
        "cons": "\"SAP is a very process controlled application. It does not allow users to manage the data. Once the initial process is set, it works smoothly.\""
    },
    {
        "title": "It integrates everything into one process",
        "name": "AppArch25",
        "pros": "\"The integration with others application could be easier. There are many different features that this solution offers which could be easier to implement.\"",
        "cons": "\"ERP is very stable.\""
    },
    {
        "title": "Useful for output storing, algorithm and reporting purposes",
        "name": "Jayabarath S",
        "pros": "\"In the next release, I would like to see more technical integration for directly designed solutions on behalf of the selling process so that you can design solutions and not have to use ten or more other tools to get the solution for selling.\"",
        "cons": "\"Overall the solution is very good in the industry.\""
    },
    {
        "title": "Automation assists us with operations from supply requisition to invoicing",
        "name": "reviewer1123512",
        "pros": "\"The flexibility in using the software could improve. I am from a product background and I've been testing a lot of applications, for example, Informatics. The UI, features, and cloud version could improve.\r\n\r\n\"",
        "cons": "\"SAP is already working on improvements by doing annual releases with enhancements.\""
    },
    {
        "title": "Very good customization features; stable with good technical support",
        "name": "reviewer1477425",
        "pros": "\"More integrations and built-in integrations with other environments and products are needed.\"",
        "cons": "\"This is a robust and feature-rich solution.\""
    },
    {
        "title": "Easy to customize and pretty stable but too expensive",
        "name": "reviewer1422672",
        "pros": "\"The user interface needs to be improved.\r\n\"",
        "cons": "\"Although you can use SAP as a Warehouse Management System, and you don’t need any other program for that purpose, it is not enough as a Transportation Management System. You need another program which is integrated with SAP.\""
    },
    {
        "title": "A comprehensive ERP solution with all key business processes covered, lacking on the user friendliness front.",
        "name": "it_user159954",
        "pros": "\"If you are well versed in SAP, the initial setup is pretty simple.\"",
        "cons": "\"Technical support could be better. \""
    },
    {
        "title": "Enterprise-wide application used across finance, HR and procurement for resource planning",
        "name": "reviewer1471602",
        "pros": "\"The solution has a lot of good integrated modules.\"",
        "cons": "\"It's difficult to code; structured language is difficult.\""
    },
    {
        "title": "Stable and scalable software for internal solutions",
        "name": "reviewer1330479",
        "pros": "\"It meets our requirements for what we need it to do in the manufacturing industry.\"",
        "cons": "\"It is a little difficult to use.\""
    },
    {
        "title": "Overall good features, stable, but lacking flexibility",
        "name": "Veerender Kumar",
        "pros": "\"The most valuable features are that it's very customizable and it's flexible.\"",
        "cons": "\"SAP ERP needs to be more innovative when it comes to areas like mobility and the internet. \""
    },
    {
        "title": "Is annually updated and enhanced",
        "name": "solution259344",
        "pros": "\"ERP is stable. The outcome is clear to us as far as the design goes.\"",
        "cons": "\"ERP could use better integration with other systems.\""
    },
    {
        "title": "A robust product, but it is expensive and the technical support is below average",
        "name": "reviewer1383990",
        "pros": "\"Its integration is most valuable.\"",
        "cons": "\"Its user interface should be improved.\""
    },
    {
        "title": "Provides us with an efficient, real-time warehouse management system",
        "name": "it_user870699",
        "pros": "\"ERP can help manage all enterprise resources. It brings them together and provides some analytical data to inform management decisions.\r\n\r\n\"",
        "cons": "\"I'm only working on the front end with ERP's user interface, which isn't very easy for end-users. It's an old-school interface, so it's often challenging to find what you need.\""
    },
    {
        "title": "Top rated ERP, but not very user friendly and tech support is lacking.",
        "name": "it_user5520",
        "pros": "\"The most valuable features are the ease of installation and the MM functionality.\"",
        "cons": "\"I always prefer using an S/4HANA system.\""
    }
]