[
    {
        "title": "Efficient payroll processing with comprehensive attendance management",
        "name": "Renelia Villanueva",
        "pros": "\"The payroll suite is very valuable. \"",
        "cons": "\"SAP HCM has helped a lot due to the always changing government regulations pertaining to taxation, social security service, and local regulations that change frequently.\""
    },
    {
        "title": "Seamless integration boosts employee management efficiency",
        "name": "Imran Hafeez",
        "pros": "\"The integration provided by SAP between different modules is very good.\"",
        "cons": "\"SAP HCM needs to be more customizable to fit unique organizational processes.\""
    },
    {
        "title": "Enhanced employee control and analytics with comprehensive integration",
        "name": "Manoj-Tiwari",
        "pros": "\"SAP HCM is a competitive and comprehensive tool that covers major programs in the enterprise and supports the global process. \"",
        "cons": "\"We are able to optimize a lot of processes but there is always room for improvement.\""
    },
    {
        "title": "Recommended for large organizations and suitable for payroll operations",
        "name": "Suneeta  More",
        "pros": "\"The payroll operations I’ve managed within this and other organizations involve substantial numbers, demonstrating that SAP HCM stable product. As for talent management, we’ve utilized consulting services and supplemented them with various in-house developments. Moreover, we are exploring innovative AI, including chatbots and AI-driven use cases.\n\n\"",
        "cons": "\"In my experience, SAP HCM and similar products are very good, but the focus now should be on providing features to encourage employee adoption. For example, accessing pay slips is a task that naturally drives adoption. However, AI tools that can prompt employees at the right time through the right application are needed for actions such as conducting surveys or gathering performance feedback.\n\n\""
    },
    {
        "title": "Allows you to generate reports, easy integration and offers out-of-the-box support",
        "name": "Kumar-Saurav",
        "pros": "\"The compliance management functionality is quite good. \"",
        "cons": "\"The limitation of HCM compared to new-era human capital management solutions is the cost. \""
    },
    {
        "title": "Efficiently handles the entire hire-to-retire cycle management within an organization and the ability to scale is outstanding",
        "name": "Vasu Narasimha",
        "pros": "\" It's very suitable for large, multi-geography companies but also very suitable for medium companies with multi-geography operations. \"",
        "cons": "\"A better user interface and greater AI integration are crucial.\""
    },
    {
        "title": "Helps to manage global workforce and payroll",
        "name": "reviewer2516868",
        "pros": "\"The payroll function in SAP HCM has been most beneficial for managing global workforces. We plan to use goal management and KPI features to link to payroll through the SAP SuccessFactors module.\n\n\"",
        "cons": "\"There's still room for improvement. We need end-to-end systems. Only the HR team uses HCM, but employees don't have access to their data. With Employee Central, employees can see their ratings, increment cycles, and other details, making things more transparent.\n\n\""
    },
    {
        "title": "High performance, high availability, but more resources needed",
        "name": "Kumar Madhur",
        "pros": "\"SAP HCM has a good performance.\"",
        "cons": "\"SAP HCM could improve by having more resources and making it more user-friendly. It is complex.\""
    },
    {
        "title": "A highly scalable tool used for payroll management and HR-related activities",
        "name": "Belinda Pearson",
        "pros": "\"I think HCM was the most stable for me...It is a very scalable product.\"",
        "cons": "\"Managing changes in applications can be challenging since it complicates testing and unit testing, resulting in longer testing phases. This time-consuming process often leaves little room for actual work.\""
    },
    {
        "title": "Is very effective for talent management and the account module is very good",
        "name": "Vishal-K",
        "pros": "\"The feature I like most in SAP HCM is its effectiveness for talent management.\"",
        "cons": "\"When performing reconciliation, manual entry is sometimes required, and barcode scanning isn't always available.\""
    },
    {
        "title": "Scalable product with valuable analytical data management features",
        "name": "Rajkumar V P",
        "pros": "\"SAP HCM has valuable features for analytics data management.\"",
        "cons": "\"The product's learning and development features could be better, including new exclusive LMS tools. \""
    },
    {
        "title": "Allows us to do all of our HR management processes, including payroll and personal administration",
        "name": "Dave Dumeni",
        "pros": "\"Technical support is excellent.\n\"",
        "cons": "\"The current platform is quite rigid and not as flexible and end-user friendly as other HR solutions. \""
    },
    {
        "title": "Helps in hiring and payroll management but data input should be accurate",
        "name": "reviewer1039926",
        "pros": "\"Payroll is always the central area the tool focuses on. It needs to ensure things are flowing, employees are paid on time, and there are no issues related to location, pay, or hiring. SAP HCM helps observe all the work, from hiring to paying paychecks every month. It's a system that depends on the data you input. You don't want to work with bad data and expect miracles. If the data isn't clean, it's more work.\n\n\"",
        "cons": "\"What can be improved in SAP HCM depends on the industry it serves. The system's navigation could be simplified for users. The flow and integration between parts, like core HR, payroll, and recruiting, must be communicated properly. Users should focus on how doing things correctly from the start will improve things in the long run rather than feeling overwhelmed by tasks.\n\n\""
    },
    {
        "title": "Effectively manages employee data and has good technical support",
        "name": "MuhammadNadeem2",
        "pros": "\"The valuable features of SAP HCM include managing employee data from hiring to retirement. \"",
        "cons": "\"HCM could improve compatibility, making it more accessible via web applications and graphical interfaces.\""
    },
    {
        "title": "A feature-dense enterprise-level solution that you can modify to suit your needs",
        "name": "Solomon Gummadi",
        "pros": "\"We have features such as ABKRS based on the client's requirement, tariff and TMSTA, and so on.\n\n\"",
        "cons": "\"There are already success factors for the cloud solution which cannot be integrated into S/4 HANA.\""
    },
    {
        "title": "Provides valuable process automation features and has a straightforward setup process",
        "name": "Mohammad Alsuhail",
        "pros": "\"SAP HCM is a powerful program that can greatly benefit organizations with its comprehensive features and integrations.\"",
        "cons": "\"The product significantly improved our organization by automating many processes, which reduced paperwork and provided clearer, more accurate goals and competencies.\n\n\""
    },
    {
        "title": "Has a user-friendly dashboard and a valuable talent management feature",
        "name": "reviewer2306628",
        "pros": "\"The platform is simple to use and has a user-friendly dashboard and integration features.\n\n\"",
        "cons": "\"The product's license is very expensive.\n\n\""
    },
    {
        "title": "Challenges in deployment, particularly related to configuration and implementation",
        "name": "Ahmed_Kamal",
        "pros": "\"It is a pretty stable solution.\"",
        "cons": "\"It was difficult to deploy. There were challenges regarding configurations and implementation. So, we had a lot of issues.\""
    },
    {
        "title": "It's a good solution for payroll processing and live support is always available",
        "name": "Arsala Abbas",
        "pros": "\"Payroll processing is my favorite HCM feature, and I like all the SuccessFactors talent modules also. SAP is making good progress on enhancements to the features in the SF modules.\n\n\"",
        "cons": "\"The talent modules are lacking in HCM, so I would recommend switching to SuccessFactors for talent management, but HCM excels at time management and payroll.\n\n\""
    },
    {
        "title": "It simplifies everything for human capital management and is stable and scalable",
        "name": "Fachlul Infithar",
        "pros": "\"It simplifies everything for human capital management, and all users can do self-enrollment for leaves and those kinds of things. The employee self-service feature is quite a powerful feature for me.\n\nYou can install it on your mobile phone or iPad and do your employee service activity there.\"",
        "cons": "\"I'm currently working for a state-owned government company, and we need to follow some standards and regulations. We also have a strategy to be followed. Sometimes the template and the format are not available in the SAP HCM, so we have to work around this limitation. The tax also sometimes changes in my country, and we have to redo everything to change the payroll calculations, benefits, and things like that.\n\nThe talent management feature can be improved. It is currently very simple in SAP HCM.\nSAP is also very hard to integrate. In terms of monitoring, there are no monitoring tools, but as long as we take care of the disk capacity, there is no problem. \""
    },
    {
        "title": "Customers can create custom infotypes to store any custom data points",
        "name": "HeHR893021",
        "pros": "\"We have managed to consolidate our payroll for all India operations on this platform.\"",
        "cons": "\"System usability is a challenge.\""
    },
    {
        "title": "Comes with easy reporting capabilities, which allows to generate reports for management meetings and auditing purposes",
        "name": "Naomi Kreinz",
        "pros": "\"The tool's most valuable features for our HR operations include easy reporting capabilities, which allow us to generate reports for management meetings and auditing purposes. Additionally, it supports appointment preparation and processing benefits.\n\n\"",
        "cons": "\"SAP HCM cannot integrate with other third-party applications. One of the drawbacks we encounter with SAP HCM, specifically in payroll management, is the limitation regarding changing payroll areas within the same month. For instance, if an employee transitions from staff to non-staff status during the month, we face difficulties because the system doesn't allow us to change the payroll.\n\n\""
    },
    {
        "title": "A good solution for core modules like personnel and payroll, but needs a total upgrade to the talent management modules",
        "name": "Sara Kadry",
        "pros": "\"Recently, the localization versions for different countries were increased, and that added value to the solution.\"",
        "cons": "\"There needs to be a renovation of the interface and functionalities of the talent management modules.\""
    },
    {
        "title": "The solution provides useful payroll and time management features",
        "name": "VenuKammari",
        "pros": "\"The payroll and time management features are useful.\"",
        "cons": "\"Reports need to be added on the time management side.\""
    },
    {
        "title": "A scalable solution that can be used to manage employee data like performance and payroll",
        "name": "Maheen Mehmood",
        "pros": "\"All our employee data, like performance and payroll, is managed through SAP HCM.\"",
        "cons": "\"SAP HCM's long and tedious transactions can be improved.\""
    },
    {
        "title": "The solution has powerful capabilities for managing small, medium, and large businesses, but we want to receive frequent updates as well",
        "name": "Darweesh Saber",
        "pros": "\"They provide the most stable and powerful technology in the areas of human resources, information systems, and ERP. \"",
        "cons": "\"The setup comes with a set of challenges as well. \""
    },
    {
        "title": "Helps maintain employee records, payroll and timesheet and includes SAP SuccessFactors",
        "name": "AjayKumar14",
        "pros": "\"The tool's best feature is SAP SuccessFactors. \"",
        "cons": "\"SAP HCM needs to improve its UI. \""
    },
    {
        "title": "A powerful, user-friendly tool for maintaining company data",
        "name": "Sameer Younas",
        "pros": "\" When you maintain your data in SAP, you can generate any kind of HR report with one click.\"",
        "cons": "\"It would be very helpful for our company if a new version was released with the ability to contain all of the things that we have newly introduced in our company.\""
    },
    {
        "title": "Enables us to understand the employee processes from hiring to departure",
        "name": "NontokozoKunene",
        "pros": "\"Sometimes, employees may have pending requests that need approval, so you should check those and clear any errors to ensure smooth processing.\"",
        "cons": "\"The most valuable feature is Organizational Management (OM).\""
    },
    {
        "title": "Good organizational management functionality and technical support",
        "name": "it_user1220727",
        "pros": "\"This solution needs to be more configurable and user-friendly.\n\"",
        "cons": "\"It has the best data management features.\""
    },
    {
        "title": "Provides a stable and efficient ERP system",
        "name": "Asad Rehman",
        "pros": "\" Its reporting feature could have customization options. \"",
        "cons": "\"HCM is a very important module that each organization should want to use. It will help any organization to calculate and control the cost of their human resources.\""
    },
    {
        "title": "Some capabilities are self-service for the employees which cuts down on administrative time",
        "name": "AhmedAbdelhady",
        "pros": "\"SAP now does the most innovation for the cloud solution and less innovation for the on-premises client.\"",
        "cons": "\"The master data where most of the reports were run from was the most valuable. We were quite satisfied with this module.\""
    },
    {
        "title": "Easy to scale out to three different regions and pull reports based on those regions",
        "name": "LangfordMunthali",
        "pros": "\"It is a bit tedious and manual to work with.\"",
        "cons": "\"They have some interesting features in the learning space.\""
    },
    {
        "title": "Easy to install, scales well, reliable, and has interesting features for learning",
        "name": "Rajkumar V P",
        "pros": "\"The extensibility of the integration could be improved.\"",
        "cons": "\"The most valuable feature, in my view, is the level of exceptions or error messages that come back when something goes wrong. \""
    },
    {
        "title": "The most valuable feature is ease of use.",
        "name": "it_user521961",
        "pros": "\"It takes a long time to apply an update patch to the system.\"",
        "cons": "\"It is a scalable solution. There are three administrators maintaining the solution: an HR person, a payroll person, and one backup.\""
    },
    {
        "title": "Good exception messages, reporting capability, and integration, but the interface needs to be modernized",
        "name": "reviewer1194150",
        "pros": "\"The breadth of functionality offered by SAP HCM comes at a cost.\"",
        "cons": "\"We are satisfied with the reporting by SAP HCM.\""
    },
    {
        "title": "Efficient payroll functionality",
        "name": "reviewer1338723",
        "pros": "\"We find some challenges in the integration between SAP HCM and SAP SuccessFactors.\"",
        "cons": "\"The integration between the different models like personnel administration, work management, payroll, and time management are the most valuable and key features.\""
    },
    {
        "title": "A stable solution that provides good reporting and can be used for payroll and core HR",
        "name": "Andrews Raj",
        "pros": "\"On the personnel administration side, it's very difficult to do custom development. \"",
        "cons": "\"SAP HCM can handle a large number of employees. We can easily process payrolls and check the arrangements, and the client can also check the performance of the employees. Additionally, it has some advanced features. \""
    },
    {
        "title": "Offers superior functionalities, and  has an overall superior package",
        "name": "Alam Khan",
        "pros": "\"I like the talent, recruitment, and learning features the most.\"",
        "cons": "\"I would like it to move more towards a single data space, a single data source. SAP as a platform relies on multiple data sources because traditionally, it's been bolted together by the acquisition of other products rather than a single database. That's why there are lots of points of failure and lots of required points of integration. They need a single integration point.\""
    },
    {
        "title": "Has user-friendly dashboards but it is very difficult to do custom development",
        "name": "Porsche D'Oliveira",
        "pros": "\"All of the core processes are very valuable aspects of the solution. These include personnel, administration, organizational structure, and payroll.\"",
        "cons": "\"The organizational structure visualization could be improved in future releases. The solution has a very poor interface.\""
    },
    {
        "title": "Support large user numbers, easy to manage, but price could improve",
        "name": "reviewer938739",
        "pros": "\"The most valuable feature is the Personnel Administration.\"",
        "cons": "\"The speed of technical support can be improved.\n\""
    },
    {
        "title": "The service support needs improvement due to slow responsiveness. Solution provides a breadth of services.",
        "name": "it_user516576",
        "pros": "\"We've found that the solution has the capability to scale. \"",
        "cons": "\"The solution is rather expensive.\""
    },
    {
        "title": "Provides talent, recruitment, and learning features, but needs a single integration point and modern architecture",
        "name": "reviewer1406562",
        "pros": "\"The user interface is the solution's most valuable feature. It makes it easy for us to use.\"",
        "cons": "\"The implementation of the solution can be a bit difficult. They should make it easier. If it could be as simple as the SuccessFactors implementation that would be ideal.\""
    },
    {
        "title": "The SAP JAM and Apps have made it social media- and mobile-friendly.",
        "name": "it_user522975",
        "pros": "\"The stability of the solution is good.\"",
        "cons": "\"SAP is not ready to sell the license on time and delays the progress of projects. It's better to work with a competitor like Oracle. Those that are selling the product just go through powerpoints and don't have the knowledge necessary to sell. They can't answer any questions.\""
    },
    {
        "title": "An all-round good solution for HR related processes that's stable and offers good technical support",
        "name": "reviewer1199859",
        "pros": "\"The setup was straightforward.\"",
        "cons": "\"SAP HCM has many different channels for communication with the consultants which makes it complex. There are delays when there is a problem.\""
    },
    {
        "title": "The initial setup is straightforward with out-of-the-box integration between different modules",
        "name": "it_user765252",
        "pros": "\"The technical support is quite good.\"",
        "cons": "\"It would be nice if the solution migrated to S/4HANA.\""
    }
]