[
    {
        "title": "User-friendly dashboard, reporting tool, and good performance for the single-source universe",
        "name": "reviewer1772163",
        "pros": "\"The reports are most valuable. If it is a single-source universe, based on only one database, the performance, and the reporting tool is user-friendly, and users are very familiar with the tool and are comfortable using it.\"",
        "cons": "\"The performance could be improved, like when we extract a large amount of data.\""
    },
    {
        "title": "A reliable, stable, secure, and mature tool",
        "name": "Andy Pan",
        "pros": "\"BusinessObjects can handle a lot of usage on the front end, and many users can view these reports.  It's a relatively stable and secure tool.\"",
        "cons": "\"When we implemented BusinessObjects, the setup was straightforward. After SAP bought BusinessObjects, it gradually became more and more stepwise. There are too many steps, and they take too much time. \""
    },
    {
        "title": "Fully integrated enterprise-level tool",
        "name": "Sumeet  Zalpuri",
        "pros": "\"The platform is a complete enterprise-level tool where everything is integrated to suffice your requirement.\"",
        "cons": "\"The SAP BusinessObjects Business Intelligence Platform has always struggled with dashboarding.\""
    },
    {
        "title": "Integrates seamlessly within our Epic environment, provides flexibility for numerous data resources, and operates efficiently",
        "name": "reviewer1664538",
        "pros": "\"I like the fact that we can integrate it seamlessly within our Epic environment, but probably the best thing that Crystal Reports offers is the ability to do visualizations. They're simple to do, and they're catchy. So, it is a really great tool.\"",
        "cons": "\"We're an Epic shop, and Epic is moving away from Crystal. It would be nice if it had tighter integration with products like Epic. It would be awesome to have better integration with third-party products.\""
    },
    {
        "title": "Visualization is better than other tools, offers good dashboard and analytics features  but  it is not easy to adapt  to the product",
        "name": "MukeshMathur",
        "pros": "\"First of all, visualization tools, productivity, and predictive forecasting are mature. \"",
        "cons": "\"The cost of this product, so every company is not suitable to use it. Because of the very huge amount of integrations, every organization can not use it.\""
    },
    {
        "title": "Easy to set up, good reporting, and very efficient",
        "name": "Paul Grill",
        "pros": "\"The ability to merge dimensions in a report is great.\"",
        "cons": "\"We would like to see a native version of BusinessObjects and Web Intelligence created for the cloud.\""
    },
    {
        "title": "A user-friendly solution for reporting but needs improvement in pricing",
        "name": "reviewer2260338",
        "pros": "\"The most important feature of BusinessObjects is its integration with the SAP ERP system. If an organization is using SAP as its ERP system, and they want to do business intelligence, reporting, or analysis, SAP BusinessObjects is the only tool that I see doing that quite efficiently. That's because of the fact it is tightly integrated, and it gives a good user experience in terms of faster reporting. Its integration is the feature that I have found most valuable, but there are also other factors. \"",
        "cons": "\"I really want SAP to focus on the dashboarding side. Based on what I have seen in the past 10 years, dashboarding has captured a lot of markets. Executives at the top-level want data that is summarized, looks good, and tells you a story. That's where Tableau, Qlik, and Power BI have an upper edge. It doesn't mean SAP doesn't give you dashboarding. They do have a dashboarding solution, but Tableau, Qlik, and Power BI are more intuitive and more attractive. I would like SAP to capture the dashboarding market as well, wherein they give at least some competition to other competitors. Presently, Tableau, Qlik, and Power BI are leading the market. \""
    },
    {
        "title": "Integrates very well  with SAP ERP,  allows you to scale up or down anytime, and is absolutely trustworthy",
        "name": "SumeetZalpuri",
        "pros": "\"The scheduling and publication features are very useful.\"",
        "cons": "\"Technical support may not always be timely or effective.\""
    },
    {
        "title": "Efficient  reporting and high performance for large data volumes",
        "name": "Sumit Chhabra",
        "pros": "\"Business analytics are the most valuable features of this solution; I don't have experience with the other functional features offered.\"",
        "cons": "\"The initial setup could be simplified.\""
    },
    {
        "title": "BI reporting is useful, but there are issues with instability following patch releases",
        "name": "Shylaraj AK",
        "pros": "\"There are two tools inside BusinessObjects' schematic layout called the Universal Design Tool and Information Design Tool. These are the most powerful tools that set BusinessObjects' reporting from other solutions. If my organization has 300 or 400 tables, I can combine all of them into one universe, and everyone can use that. It is just a schematic layout that does not hold any data but the table relationships.\n\n\"",
        "cons": "\"Factoring in total implementation and maintenance costs, SAP BusinessObjects is too expensive. If you deal with a huge amount of data, you can go with BusinessObjects. However, if you are a medium-sized company with a modest amount of data, you can opt for another solution.\n\n\""
    },
    {
        "title": "Web intelligence will work with any amount of data even if you have 10 million rows",
        "name": "DENNISSUNNY",
        "pros": "\"We find that we can scale it as needed.\"",
        "cons": "\"It could be a lighter solution.\""
    },
    {
        "title": "Easy to set up, included in the SAP portfolio, and good for analytics",
        "name": "YogendraSingh",
        "pros": "\"We find the product to be very stable. \"",
        "cons": "\"It needs to be more flexible for the end-user.\""
    },
    {
        "title": "Stable, easy to use, and scalable",
        "name": "Vishal Khare",
        "pros": "\"The solution can scale. \"",
        "cons": "\"The platform should be a bit more user-friendly.\""
    },
    {
        "title": "Helps with decision making, reliable, and make information gathering simple",
        "name": "Emilio Valle",
        "pros": "\"What I like the most about SAP BusinessObjects BI Platform is that it has significantly improved our decision-making process.\"",
        "cons": "\"There is room for improvement in providing more user-friendly and versatile reporting options.\n\""
    },
    {
        "title": "Offers a user-friendly interface and robust security measures",
        "name": "Voravit Jongrugsakul",
        "pros": "\"SAP BusinessObjects Business Intelligence Platform's most valuable features are it has a great presentation layer. We can develop the presentation layer with drag-and-drop capabilities. For end-users and for our interns in the company can create reports and do their data analysis processes or works by using the objects that we created on the presentation layer by themselves.\"",
        "cons": "\"SAP BusinessObjects Business Intelligence Platform should be made easier for the end-users and the performance could be improved.\""
    },
    {
        "title": "Beneficial presentation layer, scalable, and reliable",
        "name": "Vedat Gunes",
        "pros": "\"It is more user-friendly and easier to work with the report creation part, creating reports out of an established universe. Maybe a business person could liberate the existing universe and create a report on top of it, as well. So that's one cool feature.\"",
        "cons": "\"Most of the Apps right now are into dashboarding. This tool, for the Crystal Reports in the phase I'm primarily working on, does not have those dashboarding capabilities, like in the other advanced tools like Power BI or ClickView, and compared to them the dashboard generation is not that great.\""
    },
    {
        "title": "User friendly report creation but not great on the dashboarding side",
        "name": "reviewer1750965",
        "pros": "\"The features that I have found most valuable are that we are able to build all dashboards with self-service BI and are able to provide our business users with self-service BI. We are building a repository on top of our data warehouse and building all the dashboards and KPIs.\"",
        "cons": "\"It would be good if they could integrate the possibility for end users to create end models for themselves that they can use, especially for site operators, and if they could provide the end user not only the self-service BI, but also the self-service analytics, based on a predefined model, the same way that Oracle did.\""
    },
    {
        "title": "Very good dashboards and self-service BI",
        "name": "reviewer1664400",
        "pros": "\"The features which the solution has been awesome. The way the data is fetched from the database, and the queries are executed, is unique using the Universe of Business Objects. That makes it unique and we could not find another solution that functions in a similar way. It's has a great way of receiving and executing queries.\"",
        "cons": "\"SAP BusinessObjects Business Intelligence Platform is lacking dashboards and this would be the only reason we are looking for another solution.\""
    },
    {
        "title": "Simple setup, beneficial documentation, and scalable",
        "name": "reviewer1394319",
        "pros": "\"The Dynamic HTML (DHTML) client option of Webi has been enhanced adding features that were previously only available with the Java client including conditional formatting and support of XLS as a data provider.\"",
        "cons": "\"There is still a lot to be done on the mobile side to make Web Intelligence truly seamless between the desktop and mobile versions and I would like to see SAP pay a lot more attention to this.\""
    },
    {
        "title": "Web Intelligence really stood out in terms of new features and overall significance compared to all the other tools in the suite.",
        "name": "Paul Grill",
        "pros": "\"Has features that can be leveraged to scale out and scale up. \"",
        "cons": "\"Integrations with things like Active Directory and LDAP tend to be a little complex. \""
    },
    {
        "title": "The ad hoc capabilities using Web intelligence over universe is very productive.",
        "name": "it_user431775",
        "pros": "\"This reporting and broadcasting solution has a lot of flexibilities and can connect to multiple source systems.\"",
        "cons": "\"SAP BusinessObjects Business Intelligence Platform has to be improved performance-wise. The look and feel of this application, its scalability, setup, and technical support also need improvement.\""
    },
    {
        "title": "Once you are stable on a BusinessObjects release, it is worth staying there for a while",
        "name": "Paul Grill",
        "pros": "\"The initial setup of SAP BusinessObjects Business Intelligence Platform was easy since the solution is user-friendly.\"",
        "cons": "\"The financial area in the solution has certain shortcomings that need improvement.\""
    },
    {
        "title": "Has features that can be leveraged to scale out and up; unfortunately lacks sufficient documentation",
        "name": "Joyee Sen",
        "pros": "\"Through the use of Business Intelligence reporting and scheduling features, reports are generated and automatically sent according to a schedule. This has freed up countless hours spent performing the same tasks, month over month. \"",
        "cons": "\"The biggest area for improvement would be the dashboarding capabilities due to the recent change from Xcelsius to Dashboard Designer. This has created a gigantic ripple in many companies because the skill sets required are drastically different.\""
    },
    {
        "title": "Flexible solution for reporting and broadcasting, but its performance, look, feel, and technical support need to be improved",
        "name": "reviewer1789389",
        "pros": "\"The reporting features the solution offers are excellent.\"",
        "cons": "\"The solution could be less expensive. It's a bit pricey now.\""
    },
    {
        "title": "A stable tool with an easy setup phase that helps with the creation and manipulation of scenarios",
        "name": "Miguel Vargas",
        "pros": "\"The common metadata environment means that the entire organisation has the same definition of core measures rather than these being derived in spreadsheets or specific reports.\"",
        "cons": "\"This solution is complex to configure and administer.\""
    },
    {
        "title": "Enables quick data access without the need to involve a business or financial analyst",
        "name": "David Hudgins",
        "pros": "\"SAP BusinessObjects Business Intelligence Platform is definitely scalable.\n\n\"",
        "cons": "\"There should be more integration with other platforms.\n\n\""
    },
    {
        "title": "Web intelligence is valuable but SAP patch methodology is horrific",
        "name": "it_user26124",
        "pros": "\"The feature that allows pivot users to create the report dashboards and run them when they want with a lot of flexibility with the drill-downs is very useful. The drill-down features are very good because, in other solutions, such as Excel, you have to create separate pivot tables and a lot of other operations to do drill-downs. SAP BusinessObjects Business Intelligence Platform tool does the drill-downs automatically. Overall the solution is user-friendly and has a lot of drag and drop features.\"",
        "cons": "\"Tableau was easier for me to use because the interface is more similar to Excel which I was used to using.\""
    },
    {
        "title": "Using Xcelsius dashboard instead of Qlikview",
        "name": "Paul Grill",
        "pros": "\"It is solid and stable.\"",
        "cons": "\"Over the years, the product tends to rename and rebrand itself and change its direction. This is a deficit of the solution.\""
    },
    {
        "title": "Scalable with good technical support and excellent reporting features",
        "name": "Narayansingh Bhandari",
        "pros": "\"The planning and dashboarding features have been useful. Additionally, the fixed-format reports are good.\"",
        "cons": "\"The solution is not good for self-services, they can improve in this area.\""
    },
    {
        "title": "Good reporting and promotes a common view of information across the organisation",
        "name": "Paul Kellett",
        "pros": "\"The web intelligence reporting tool and universe designer are the most valuable aspects of the solution.\"",
        "cons": "\"Recently, it's become less stable if I am working on Citrix. \""
    },
    {
        "title": "Comparison of SAP BO, Tableau, QlikView, Cognos, Microsoft, OBIEE and Pentaho",
        "name": "it_user79932",
        "pros": "\"BusinessObject's most useful feature is the semantic layer, which offers us the flexibility to go for ad hoc reporting.\n\n\"",
        "cons": "\"The interface could be slicker and more user-friendly. \""
    },
    {
        "title": "A scalable solution for large organizations",
        "name": "reviewer1414839",
        "pros": "\"Ease of report development is a key feature. \"",
        "cons": "\"I would like to see their data visualization products enhanced and made more robust and easier to implement. \""
    },
    {
        "title": "Provided us with best practice reports out of the box for various modules. It wouldn't scale when we needed to handle over one terabyte of data.",
        "name": "it_user440979",
        "pros": "\"I have seen improvement in our work after using the solution.\"",
        "cons": "\"It is not simple to use. \""
    },
    {
        "title": "Beneficial dashboards, user friendly, and many drag and drop features",
        "name": "reviewer1683282",
        "pros": "\"If I were to compare it with Power BI and I wanted to build proper well-formatted reports, BusinessObjects Business Intelligence does that much better. Power BI is just getting into that space. They've concentrated more on visualization, which is what the SAP Lumira does. With Web Intelligence, you are able to build reports that users can interact with. They can also do a lot of querying themselves.\n\nIt is robust in terms of security and integration. It is also quite scalable.\"",
        "cons": "\"I don't like the fact that I have to use two tools. Web Intelligence is good for reporting and all kinds of stuff, but I would rather have one product. All the reporting features of Web Intelligence should be developed within Lumira.\n\nA lot of predictive abilities have been brought into the cloud version of SAP Analytics. It would be nice to see a lot of newer technologies and AI. Predictive capabilities are becoming a little more standard. Instead of having to get another model, we are just looking for one solution to deal with analytics including predictive.\""
    },
    {
        "title": "A solid, stable solution that when purchased in its full scope puts EVERY other Bi tool to shame",
        "name": "BIAnalyt2dd4",
        "pros": "\"The most valuable feature we have found to be the SAP BW, which is a warehouse tool. Additionally, it is an easy tool to use.\"",
        "cons": "\"The dashboard tool is called Lumira and it is very uncomfortable for developers to use. They should improve this in the future.\""
    },
    {
        "title": "​The combination of IDT and Web Intelligence has taken some of the burden of report creation off of our central data team. The scalability of Design Studio when using crosstabs is an issue.",
        "name": "it_user431760",
        "pros": "\"Way of creating reports.\"",
        "cons": "\"The calculation engine requires some improvement.\""
    },
    {
        "title": "Useful dashboard, beneficial fixed format reports, and reliable",
        "name": "VivekGupta3",
        "pros": "\"To share a metadata service layer, you don't need to add a user or write a SQL query. Instead, you can present a raw database to your end user. \"",
        "cons": "\"It has been extremely valuable, to combine data from various data sources.\""
    },
    {
        "title": "Sometimes we've encountered bugs, but able to get critical analysis in a fraction of time and run the business better.",
        "name": "it_user121866",
        "pros": "\"SAP BusinessObjects is actually losing popularity within our company because people find the user interface and the way things are set up not to be as easy as many other tools that are on the market, like Qlik and things like that.\"",
        "cons": "\"The user interface should be easier to use and navigate.\""
    },
    {
        "title": "It gives power to users, who can create their own queries without needing IT services.",
        "name": "it_user101874",
        "pros": "\"It provides flexibility for creating reports. It is very good for creating highly-complex reports. I like this solution because when I buy BusinessObjects, it comes with many components, such as reporting, dashboard, and data visualization tools.\n\nIts performance is good. It is running on top of SAP BW and SAP HANA.\"",
        "cons": "\"Its data visualization tool is not as good as Power BI and Tableau. Currently, for data visualization, you need to spend more money to buy another solution such as Power BI or Tableau.\n\nIt is also very hard to integrate it with other third-party solutions. Its integration with other solutions should be improved.\""
    },
    {
        "title": "Great web intelligence reporting tool and universe designer but can be expensive",
        "name": "reviewer1883496",
        "pros": "\"The setup is pretty easy. It's not hard at all.\"",
        "cons": "\"The UI could be updated a bit.\""
    },
    {
        "title": "The semantic layer offers us the flexibility to go for ad hoc reporting",
        "name": "RanvijayKumar",
        "pros": "\"The solution is stable.\"",
        "cons": "\"SAP BusinessObjects Business Intelligence Platform is an outdated solution that is missing many features.\""
    },
    {
        "title": "The Designer gives developers a powerful way to encapsulate business logic and push it out to users. Their data visualization products should be enhanced, made more robust and easier to implement.",
        "name": "it_user494013",
        "pros": "\"The solution's user security is extremely effective. You can profile very well. All the users and all the functionality is protected and that includes information and data segregation.\"",
        "cons": "\"The self-service area, or dashboard, needs some improvement. While the reporting itself is great, the dashboard and Analytics Cloud are not user friendly.\""
    },
    {
        "title": "LifeCycle manager needs more stability but Web Intelligence for its ad-hoc ability is a valuable feature",
        "name": "it_user176949",
        "pros": "\"We are using SAP BusinessObjects because its scheduling capabilities are more powerful than those of other tools.\n\n\"",
        "cons": "\"It is limited for us because SAP is shifting toward the cloud, and we can't use a cloud solution for SAP BusinessObjects. SAP introduced a product called PlusTimes one or two years ago and another one that I believe was called Automatic BI. This tool is more powerful than BusinessObjects and other tools because it's provided in the cloud.\n\n\""
    },
    {
        "title": "It has improved our work but is difficult to use",
        "name": "SergeNdin",
        "pros": "\"It allows the analysis of business data and enables decisions based on the analysis.\"",
        "cons": "\"More thorough testing of Service Packs before release.\""
    },
    {
        "title": "Robust in terms of security and integration, quite scalable, and good for building well-formatted reports",
        "name": "Popoola Adams",
        "pros": "\"​Provides autonomy for all the business users to develop their own reports.​\"",
        "cons": "\"​This product could be improved with Cloud Integrations and Predictive Analytics functions integration.\""
    },
    {
        "title": "We extensively use the publication features of Crystal Reports and scheduling features of Web Intelligence. But we had some challenges with upgrades.",
        "name": "it_user6792",
        "pros": "\"One of the most valuable features of SAP BusinessObjects is that it's not a dashboarding solution. It's a real product. You can create operational reports and publish it to anyone. You can create schedules. You can create a Universe, semantic layers. There's also a security configuration. It's a huge product, so if there is a business need, SAP BusinessObjects can cover it. \"",
        "cons": "\"The integration could be improved. The SAP suite has some integration problems and it has some huge development needs. For example, when you use Power BI, if you publish a dataset to the web, there is no issue in seeing the data with the report. The data and report are integrated automatically. Or when you use QlikView, when you publish the QVD file, the report is integrated with QVD. Also, with Tableau, when you publish the data, it's in the hyper database, in the memory, and the dashboard with data is integrated seamlessly. In the SAP side, it's not easy. There are lots of business layers.\n\nThere are also some performance issues in the SAP BusinessObjects suite. They should focus on the technologies.\n\nWe are partners and every step of the way, SAP asks us for money. If you want to see the products, the PDFs, if you want to learn the product, online training, etc., everything has a cost on the SAP site. Because of this, partners try to get to know the products on their own. SAP only focuses on the sales side—only money is important for SAP, not the quality. In that way, the operation is not easy on the SAP side. As a suggestion, they should focus on customers first instead of money. \""
    },
    {
        "title": "Useful SAP BW tool, easy to use, but Lumira dashboard tool needs improvement",
        "name": "reviewer928458",
        "pros": "\"The development using SAP BusinessObjects Business Intelligence Platform is very good.\"",
        "cons": "\"The solution can improve by having more analytical features.\""
    },
    {
        "title": "It has a wide range of compatible operating systems and it was easy to install",
        "name": "it_user87981",
        "pros": "\"It gives you a lot of flexibility in designing your dashboards.\"",
        "cons": "\"The combination of Lumira along with Design Studio merger last year still needs development from a visualization standpoint.\""
    },
    {
        "title": "Fairly scalable and stable but WebGUI presentation layer could be improved",
        "name": "reviewer1486620",
        "pros": "\"The admin features for disk space management need work. It's very difficult to manage the disk space by the application; good admin features and not included to allow you to do that. I don't believe that is in the latest version of the product either.\"",
        "cons": "\"It can process big volumes of data fast.\""
    },
    {
        "title": "Extremely valuable for combining data from various sources, but UI is not user-friendly",
        "name": "TeamLd3401",
        "pros": "\"Currently, we can use Explore to do data discovering, but cannot generate charts.\"",
        "cons": "\"It is stable and robust. It has pretty direct integration with SAP ERP. It is easy to use. \""
    }
]