[
    {
        "title": "Native encryption ensures secure data management with a simple deployment",
        "name": "Muzzamil  Hussain",
        "pros": "\"The most valuable feature is the on-premises data encryption facilities. \"",
        "cons": "\"The data masking functionality should be improved as well as the native encryption functionality in the MySQL database. \""
    },
    {
        "title": "Lightweight and is available at a friendly price",
        "name": "Naresh Kumar",
        "pros": "\"It is a stable solution.\"",
        "cons": "\"The performance issues in the product can be considered as an area where improvements are required.\""
    },
    {
        "title": "Good beginner base but it should have better support for backups",
        "name": "Patryk Golabek",
        "pros": "\"This specific version of this MySQL has been battle tested for a long time. Any issues are known issues and we pretty much don't have any problems when they're in production. So it's very stable. \"",
        "cons": "\"In terms of what I'd like to see in the next release, one thing that's always missing is dash boarding. There's no real BI tool for MySQL, like there is in Yellowfin and all the different tools that you get. They all have MySQL connectors, but there's no specific BI tool for MySQL. These open source projects have sprung up, but they're more general purpose.\""
    },
    {
        "title": "Enables a wide range of features and benefits, including high performance, scalability and security",
        "name": "Ravi Upadhyayula",
        "pros": "\"While MySQL offers strong basic functionality.\"",
        "cons": "\"MySQL lacks a feature akin to Oracle's Real Application Clusters, which ensures continuous database availability within the same data center or nearby data centers. \""
    },
    {
        "title": "Structure is well-defined and easy for end users and business stakeholders to read",
        "name": "SurajSachdeva",
        "pros": "\"I find MySQL's relational data storage format very useful for data management. Our structure is well-defined and easy for end users and business stakeholders to read. I appreciate the tool's simplicity and ability to integrate with our backend tools.\n\n\"",
        "cons": "\"As for areas that could be improved, the tool is often used as a local database on laptops. But now, we're moving to cloud-based solutions that are more scalable and highly available. I think the tool should offer a cloud database option. This would let users keep a local copy of data if needed, but also have their data available across different regions through a cloud account.\n\n\""
    },
    {
        "title": "Easy to use, code is easy to write and understand",
        "name": "Prince Raju",
        "pros": "\"The initial setup is easy.\"",
        "cons": "\"The user interface could be more user friendly. Mainly because most of the times we see black and white digital lines. Something like Python. \""
    },
    {
        "title": "Provides good indexing and supports multiple data types, but performance needs to be improved",
        "name": "Shivaprasad C S",
        "pros": "\"I would use MySQL for a medium project, with around 1,00,000 hundred thousand users, because of the indexing and stored procedures.\"",
        "cons": "\"MySQL's performance needs to be improved for enterprise-level applications compared to Oracle and Postgres.\""
    },
    {
        "title": "Provides powerful data querying.",
        "name": "PrinceKumar2",
        "pros": "\"MySQL gives us a very user-friendly workspace in which to query the database.\"",
        "cons": "\"We have encountered some performance issues, and the solution takes time for performing complex queries.\""
    },
    {
        "title": "Great cluster setup; works fine on the technical side",
        "name": "Kevin Honde",
        "pros": "\"The way that MySQL has improved my organization is that it comes free and also works fine on the technical side.\"",
        "cons": "\"The integration with other systems can be improved as can the integration between other databases. \""
    },
    {
        "title": "A reliable, free, and easy-to-use solution",
        "name": "CharlesBrewer",
        "pros": "\"For starters, it's free, which is always nice, and it's also pretty straightforward to use. It's a nice conventional database.\"",
        "cons": "\"The workbench could be improved. In particular, error messages can be improved, which are horrific and completely unhelpful. I'd like to see improved parsing of errors. When you write SQL and it crashes, it usually is something completely irrelevant and not helpful. I've started to use GPT 3.5 for finding out how to do things. I got to do something a bit different, and that I found to be very useful. If there was some way to tie it into one of the new AI tools, that would probably be a good idea.\""
    },
    {
        "title": "Easy to use and can be used to store data",
        "name": "Prince Barai",
        "pros": "\"MySQL is an easy-to-use solution that provides stability, reliability, flexibility, performance, security, and high availability.\"",
        "cons": "\"MySQL could introduce more indexing strategies.\""
    },
    {
        "title": "Free, open-source, and easy to use",
        "name": "Satishbabu Gunukula, Oracle ACE",
        "pros": "\"MySQL has cross-platform support for multiple operating systems. The backups on a Linux machine can be restored on a Windows machine, and vice versa.\"",
        "cons": "\"Improvements are required in character set support, scalability, and big data sets.\""
    },
    {
        "title": "Open-source solution to store data of hardware servers and their configurations",
        "name": "MohamedKhalifa",
        "pros": "\"SKIP LOCKED is a valuable feature.\"",
        "cons": "\"The full-text search feature must be improved.\""
    },
    {
        "title": "Easy to manage, saves time, and provides good documentation",
        "name": "James  Kulundu",
        "pros": "\"MySQL is the best option for the Laravel PHP framework.\"",
        "cons": "\"In MySQL, we need to define every table beforehand.\""
    },
    {
        "title": "Supports Laravel PHP framework, but we need to define every table beforehand",
        "name": "Prashob Km",
        "pros": "\"MySQL is an open-source product and has good community support. If you encounter any problem, you can easily ask other members of the community to help. They help you a lot. On top of being free, MySQL is a cross-platform database, meaning it can work on both Windows and Linux. It is very good for us.\"",
        "cons": "\"I would like to see the automatic backup feature in the solution as well. Data is very important and we need to preserve it in a safe place. It would be good if MySQL can back up the data automatically.\""
    },
    {
        "title": "Can work on both Windows and Linux and has a supportive community",
        "name": "Alireza-Nikseresht",
        "pros": "\"The solution helps us perform with our databases and extract data. \"",
        "cons": "\"Clusters are hard to perform so we use no SQL alternates like MongoDB. \""
    },
    {
        "title": "The best choice for new database management users and smaller data to 60K",
        "name": "reviewer2089122",
        "pros": "\"The installation process for the most scalable solution is remarkably quick, taking only a short amount of time.\"",
        "cons": "\"While utilizing a comparable algorithm, is noted to be sensitive, especially when configuring the inner device.\""
    },
    {
        "title": "Robust relational database management system offering flexibility and efficient data management for diverse applications",
        "name": "Ruhul Amin",
        "pros": "\"Compared to other databases, MySQL is cheaper and we were using the community edition which was free of cost. ML is fully integrated with the database in HeatWave. It has also many other features. MySQL is a far better solution in terms of pricing.\"",
        "cons": "\"I would like to see more integrations of the solution with other platforms and improve the support on different data types.\""
    },
    {
        "title": "Highly recommend solution for OLTP applications",
        "name": "Guruprasad Gonjare",
        "pros": "\"MySQL is open-source. There are a lot of open-source communities trying to come up with their own patches, and to come up with their own features, which help MySQL develop faster than traditional databases like Oracle, which is closed source.\"",
        "cons": "\"They should come up with a better solution than the NDB cluster for better scaling. If they could come up with a better solution for write scaling, apart from the NDB cluster, which is supported by all open source communities, that would be great. Although the NDB cluster, I believe, is an open-source tool, it's not widely supported as a solution.\""
    },
    {
        "title": "A great open-source product that offers great scalability and compatibility",
        "name": "reviewer1378032",
        "pros": "\"I like the simplistic view of MySQL to build custom queries and things like that as compared to SQL Server, which seems more cluttered.\n\nSQL Server has a query analyzer. MySQL pretty much does the same, and performance-wise, it has less overhead for connecting to our ERP system. It seems more responsive and cleaner. With MySQL, you get what you need without any overbloating, for which Microsoft is known. That's why they have so many constant security patches for everything because there is so much stuff, which degrades performance.\"",
        "cons": "\"The GUI interface probably can be improved. Let us say I want to see the relationships in the database. In the query analyzer, I would like to go and drop the tables and create relationships between the tables. I haven't found a feature like that in MySQL. It was a shortcoming even in SQL Server.\n\nMySQL can have more performance monitoring tools. I know Google has these tools, but within MySQL, there are not that many tools to monitor things like performance and database locking. They might be in there, and I might not be familiar enough to know where they are. I am a pretty new user of MySQL.\""
    },
    {
        "title": "Provides a simplistic view for building custom queries and has less performance overhead",
        "name": "reviewer1432350",
        "pros": "\"MySQL is easy and convenient for me. I don't need to rely on anyone. I can write the code and extract the information. It is fast if you know how to use it. The solution is not expensive, and most of the developers know how to use it. It is easy to create tables. The solution is stable and has good performance. The connection with AWS gives regular updates, which is manual otherwise and a nightmare. \"",
        "cons": "\"The tool needs to improve table visualization.\""
    },
    {
        "title": "An easy and convenient solution with good performance",
        "name": "Serge Dahdouh",
        "pros": "\"MySQL is a scalable tool. Scalability-wise, I rate the solution a nine out of ten...The solution's technical support is good. I rate the technical support a nine out of ten.\"",
        "cons": "\"There should be an arrangement for end-users to get trained to use the tool...Improvement-wise, a graphical interface could be added for new users, eliminating the need to memorize the complex syntax.\""
    },
    {
        "title": "A powerful tool that can perform multiple analyses and reveal hidden insights in datasets to its users",
        "name": "Deepak Sahu",
        "pros": "\"The initial setup was easy. I work in an agile way, which means coding and deploying quickly.\"",
        "cons": "\"MySQL's performance requires attention. For optimal performance, one should review and sometimes revise the code, particularly when using server-side scripting. \""
    },
    {
        "title": "Good  service provider, agile and quick deployment",
        "name": "Philippe Liénard",
        "pros": "\"MySQL's most significant attribute is its capability to create, modify, and maintain databases. This is crucial and advantageous in procedures, such as SOAR. Therefore, all SQL functions are beneficial to any backend developer or developer who requires data storage.\"",
        "cons": "\"Improvements to MySQL depend on the specific use case. For example, in my scenario, I frequently need to maintain and store data, which can then be utilized to generate reports. On the other hand, others may suggest incorporating a feature that allows for easier visualization of the data, such as what is available in Power BI or other similar tools.\""
    },
    {
        "title": "Efficient data loading, beneficial for data manipulation, and strong support",
        "name": "Mohini Kushwaha",
        "pros": "\"The speed is very good.\"",
        "cons": "\"At times, the autoscaling does not happen when there is a surge in load.\""
    },
    {
        "title": "The performance is optimal, the speed is very good, and there are no delays in fetching data",
        "name": "Anand Viswanath",
        "pros": "\"It's a mature solution that's been around for decades.\"",
        "cons": "\"It isn't as reliable as an SQL Server.\""
    },
    {
        "title": "Open-source and easy to implement but needs a lot of updating",
        "name": "Ahmed-Ramy",
        "pros": "\"The one interesting thing about this product is that it is open source. It comes from an open source product. MySQL has been positioned as open source, but it also provides support. \"",
        "cons": "\"If the customer is already using or has already used Oracle for a long time they will know the look and feel and the character of this database that can fit into their business.\""
    },
    {
        "title": "Has a simple and user-friendly installation",
        "name": "Arief Gunawan",
        "pros": "\"The relations in the database, the dynamic workflow, and the ability to connect with all columns. It's useful for e-commerce.\"",
        "cons": "\"I would rate the stability a seven out of ten. It does break down a little at times. \""
    },
    {
        "title": "Dynamic workflows but lacks stability",
        "name": "Maher Shahzalal",
        "pros": "\"We are completely comfortable with the database’s performance and it is a mature product. My organization was looking for an open-source database for our smaller customers like the community edition. For bigger customers, we can scale into commercial and supported editions.\"",
        "cons": "\"I would like to improve the solution’s pricing for licenses.\""
    },
    {
        "title": "A mature solution with stable performance for database management",
        "name": "CharlesGuise-Brown",
        "pros": "\"My main reason for using MySQL for this small customer database company and for some kinds of scientific projects was that I had to do the installation myself. I didn't have a database administration team behind me. Therefore, I was looking for something very easy to handle. MySQL is easy to install, connect, and do all such things.\"",
        "cons": "\"Its scalability can be better. It is probably not as scalable as Oracle.\n\nI had some issues with connectors. I used it from a C++ program, and it required some work to make it run, but finally, it worked.\""
    },
    {
        "title": "Easy to install, easy to handle, and suitable for a limited amount of data",
        "name": "PeterKrall",
        "pros": "\"The solution has been very easy to scale so far.\"",
        "cons": "\"The backup methods need improvement. \""
    }
]