[
    {
        "title": "Performs all necessary data warehouse tasks and offers additional functionalities",
        "name": "Csaba Grünblatt",
        "pros": "\" I like how it blends no-code and ABAP code for complex transformations during data loading.\"",
        "cons": "\"One thing that could be enhanced in SAP BW4HANA is the user interface for process chains.\""
    },
    {
        "title": "Intuitive modeling and reporting capabilities and supports both vertical and horizontal scaling",
        "name": "AjayKumar7",
        "pros": "\"It provides the functions in a way that even a less technical person can do the modeling. \"",
        "cons": "\"Real-time processing isn't BW/4HANA's strongest point. \""
    },
    {
        "title": "Offers good value for money to users",
        "name": "DilipRoshantha",
        "pros": "\"It is a stable solution. \"",
        "cons": "\"The product's initial setup phase is a bit complex.\""
    },
    {
        "title": "Improves data analysis and reporting processes",
        "name": "Hanif Shaikh",
        "pros": "\"It is a stable solution...It is a scalable solution.\"",
        "cons": "\"The cost of the product might be an area that might introduce some restrictions or limitations to customers, making it one of the aspects where improvements are required.\""
    },
    {
        "title": "Enables consolidation of data across  an organisation  onto a single  platform for enterprise  data insights & analytics",
        "name": "Srivatsav Andra",
        "pros": "\"You can do hierarchical alert slicing and dicing out-of-box, which is not available in other solutions. I haven't come across that in Oracle or any other software provider.\"",
        "cons": "\"There's one area where the other vendors have an upper edge, which is the data lake. I think SAP is trying to figure out whether to stick with IQ, their own data lake solution, or push customers toward customer-preferred vendors, like Azure Data Lake, AWS, or any other provider.\""
    },
    {
        "title": "Offers users robustness and customizability options",
        "name": "reviewer2508063",
        "pros": "\"The solution's most valuable feature is that it is a very powerful tool. The solution also has the best stability, robustness, and customizability features.\"",
        "cons": "\"SAP BW/4HANA can generally be less flexible than other tools, depending on how it is set up.\""
    },
    {
        "title": "Enables real-time data analytics,  ﻿improves data governance practices but resource-intensive solution",
        "name": "Anandha Krishna",
        "pros": "\"One significant advantage of SAP BW/4HANA is the direct integration with the SAP HANA database, providing seamless access to real-time analytics.\n\nAdditionally, it enables real-time data integration. We don't need to rely on historical data alone; we can provide reporting and features based on real-time information. \"",
        "cons": "\"There's the complexity in migration from BW to BW/4HANA, especially with data migration. \""
    },
    {
        "title": "Can be installed through a straightforward process, but support needs improvement",
        "name": "Kiran Singh",
        "pros": "\"It is a very stable solution.\"",
        "cons": "\"I don't see SAP actively supporting the solution now...a better support from SAP would be appreciated.\""
    },
    {
        "title": "A data warehousing solution to pull and extract data but needs flexibilty",
        "name": "Joudat Hashmi",
        "pros": "\"The solution seamlessly integrates with SAP products.\"",
        "cons": "\"We cannot integrate with third-party tools like Python or advanced integration options. You can't fine-tune tables within BW or generate specific views or reports.\""
    },
    {
        "title": "Very robust but is expensive",
        "name": "Shaik Abdul Khadar",
        "pros": "\"Technology-wise, it is a very robust tool.\"",
        "cons": "\"The problem is the expensive pricing of technical support, making it an area where improvements are required.\""
    },
    {
        "title": "The product has good reporting features, but it is not cloud-compatible",
        "name": "reviewer2278119",
        "pros": "\"I like the reporting features of the solution.\"",
        "cons": "\"The tool is not cloud-compatible.\""
    },
    {
        "title": "Offers good visualization and less redundant data but needs improvement in performance",
        "name": "Sivaiah Pa",
        "pros": "\"We can get good visualization and less redundant data. \"",
        "cons": "\"The product needs to improve with more performance and fewer data layers. \""
    },
    {
        "title": "Good capabilities, direct approach, and the right reporting tool for SAP companies",
        "name": "reviewer1426734",
        "pros": "\"Its direct approach is the most valuable. You get more real time and capabilities than BW. \"",
        "cons": "\"They have taken out a few BW functionalities when they redesigned this. The way of multi-dimensional thinking and star schema got a little bit lost. It may be because of the cost, but certain functionalities that were previously implemented from the BW side should come back again in the whole product. It is a young product. It is version 2.0. In time, I'm pretty sure they will come back again because otherwise, it limits the potential of the product, and I have to do a lot of modeling towards that direction. For me, the analytics focus is too much. It is not cube-oriented in that way, so its functionality is limited. It is not really technically limited in the back end; it is more limited in the front end. It has a data-mining mindset for SQL developers. The navigational attributes should be easy.\n\nIt needs to be built in models. I see the data mark cube or understanding that the composite provider needs to be models in a cube coming back. The multi-dimensional star schema approach and the reporting need to be done as well as possible to leverage the star scheme below. This is definitely not understood by many consultants and even composite providers for star schema. They always think in terms of flat tables, which is limiting. You need to build the right dimensions, objects, and so on. If you can build this in BW4HANA, then you have this understanding that BW4HANA is not forcing you in this direction, but it should force you a bit better in this direction. Maybe a few elements which were in use in BW should come back again. It would help the community to determine the direction to build on the cube. You can have maybe 50 elements, and then you can expand it to what you need by leveraging navigation. So far, this functionality is a little bit limited in the tool, and it is not thought through, but I think it will come. They should also be adding more capabilities for the transformation between different objects. In BW, this is currently limited, especially towards composite providers.\n\nIt is a bit complex basically in the building. You have to have a lot of knowledge as well as know how to do it better because it is a bit different from BW. There is not too much expertise currently in the consulting markets. Many are trying to build something, but it may be based on their knowledge of what they have from the BW and HANA side. You have to find the right mix from both of them at this time. We also have HANA Native. These are our two different sync sources basically, and we have approaches to connect nicely, but it is hard to manage your team because a lot of coaching is required.\""
    },
    {
        "title": "Has a simplified structure and better performance",
        "name": "AnilKumar38",
        "pros": "\"It is a stable solution.\"",
        "cons": "\"Price wise, this solution is on the higher side.\""
    },
    {
        "title": "Can be used more generally as a data warehouse and has the ability to utilize predefined content",
        "name": "Wonjae BAE",
        "pros": "\"We benefited from BW/4HANA's ability to utilize predefined content inside. We didn't need to start from scratch.\"",
        "cons": "\"The solution is not easy to implement. It requires a lot of learning at the beginning.\""
    },
    {
        "title": "Provides good features, saves time and cost, and can be used as a data source",
        "name": "Preetesh-Pardeshi",
        "pros": "\"The solution saves time and cost.\"",
        "cons": "\"There should be a direct pipeline from Azure to SAP.\""
    },
    {
        "title": "A robust and secure solution that helps to analyze data",
        "name": "reviewer2133219",
        "pros": "\"I like the tool's robustness and security.\n\n\"",
        "cons": "\"The interface could be more user-friendly, as we often need to do low-level coding to get things done.\n\n\""
    },
    {
        "title": "An easy-to-operate and administer tool that needs to consider revising its existing licensing cost",
        "name": "Joyee Sen",
        "pros": "\"The solution's performance is really good. Also, it's easy to operate, easy to administer, and relatively simple to install. \"",
        "cons": "\"The licensing cost could be made better.\""
    },
    {
        "title": "UI is completely new, beautiful, and user-friendly",
        "name": "Santosh Pallai",
        "pros": "\"The UI is completely new, beautiful, and user-friendly. There are some other helpful features like global filters and advanced tools. We can perform custom calculations easily\n\nFrom a technical perspective, the performance has been enhanced and optimized for a limited number of flows. The content settings are more advanced, and there are so many other features that I can't name them all.\n\n\"",
        "cons": "\"BW/4HANA could improve query optimization. For example, there could be an error message that pops up when you hover over it if any query fails. That would make it easier to find out what went gone wrong. Guided SAP help tools would make it easier for us to go forward.\n\n\""
    },
    {
        "title": "Instantly pull data, easy to deploy, and stable",
        "name": "Jose Jaimes",
        "pros": "\"The ability to instantly pull data is the most valuable feature.\"",
        "cons": "\"I would like to be able to design new reports in a future release.\""
    },
    {
        "title": "User-friendly and flexible with lots of standard features, but it needs to be more customizable",
        "name": "Shahnawaz",
        "pros": "\"Out of the box, this solution has a lot of standard features.\n\"",
        "cons": "\"Connecting multiple sources is a challenge because you have to go through a lot of different setups.\""
    },
    {
        "title": "With high stability and an easy setup phase, the solution needs to consider being made more user-friendly",
        "name": "RAUL PAHUARA",
        "pros": "\"It is a stable solution...The initial setup was easy.\"",
        "cons": "\"The tool is not easy to use for an end user.\""
    },
    {
        "title": "Calculates big data and has predictive analysis memory",
        "name": "it_user1202082",
        "pros": "\"It can calculate data in detail. Before we could not calculate financial documents and accountant documents in detail, we could not do it at a document level but now we can. This is the most important feature. It also has predictive analysis memory.\"",
        "cons": "\"Not a ten because it's expensive and its ecosystem is not very open.\""
    },
    {
        "title": "Has a great analytics engine with the SEM-BCS app a critical feature",
        "name": "Arijit_Sarkar",
        "pros": "\"Provides a great analytics engine with all the capabilities.\"",
        "cons": "\"The UI is not user-friendly. \""
    },
    {
        "title": "Transforms large volumes of data, good reporting, improves efficiency, and the support is good",
        "name": "reviewer1335984",
        "pros": "\"The most valuable feature is that we can transform a huge amount of data and apply business logic as per the requirements.\"",
        "cons": "\"The speed of operations could be a little faster.\""
    },
    {
        "title": "Good technical support but the reporting performance is very poor",
        "name": "Bigr67",
        "pros": "\"The most valuable feature is that it's robust. \"",
        "cons": "\"I cannot integrate it with my other tools. It's not possible to do something in the predictive analysis. Mobile reporting is also not available. \""
    },
    {
        "title": "Robust and flexible solution for Data Analytics",
        "name": "Sunishta Singh",
        "pros": "\"SAP BW4HANA aids in managing data from ER to front-end analysis, contributes to ROI, and fosters business growth understanding.\n\nI like that the solution breaks down components to a very granular level, allowing for customization and implementation based on specific requirements.\n\nThe solution is stable.\n\nThe solution is scalable.\"",
        "cons": "\"Challenges arise with real-time client requirements when clients are accustomed to Microsoft Excel's extensive features for data analysis. They expect similar flexibility and customization in the solution, particularly regarding headers displaying keys and descriptions or just keys. Achieving this level of customization can be challenging, and it's an area that may need improvement.\""
    },
    {
        "title": "Great analysis and insights with excellent reliability",
        "name": "Amrit Jha",
        "pros": "\"It's quite scalable. \"",
        "cons": "\"Support could be more reliable. \""
    },
    {
        "title": "Easily connects with the SAP ERP system but is complex to set up and increases development time",
        "name": "Bigr67",
        "pros": "\"We like that it is an SAP product, so we can easily connect with the SAP ERP system.\"",
        "cons": "\"If I want to have good reporting, then I have to buy a separate license. \""
    },
    {
        "title": "Used for ERP with good financial costing and material management features",
        "name": "reviewer1260159",
        "pros": "\"From an ERP point of view and a functionality point of view, it works very well. The benefits are in that of financial costing and material management.\"",
        "cons": "\"In the next release, I would like to see their BI component introduced with a mobile version, as it is not currently present.\""
    },
    {
        "title": "Reliable, scalable, and has good support but they need more integration",
        "name": "reviewer1454010",
        "pros": "\"I like that it's quite quick.\"",
        "cons": "\"I would like more integration.\""
    },
    {
        "title": "Useful for connectivity with external systems, but the connectivity requirement is high and requires up-to-date systems",
        "name": "Renaud Motuelle",
        "pros": "\"The solution is useful for connecting with external systems.\n\"",
        "cons": "\"From a technical perspective, it could be even more related to legacy systems. The connectivity requirement is quite high and requires systems that are up-to-date.\n\""
    },
    {
        "title": "Stable solution that provides good DW implementation for customers who already implement SAP ERP",
        "name": "LIN WEN",
        "pros": "\"The solution is based on SAP ERP, so there's some business content already included. For customers who use SAP ERP, SAP BW4HANA is a good choice for their DW implementation.\n\"",
        "cons": "\"It's complicated to use. You need to spend a lot of time learning about it. The interface could be improved. It's not intuitive to build a data model and use their ETL tools.\n\""
    },
    {
        "title": "Has all the data warehouse features, but licensing could be better",
        "name": "reviewer1749831",
        "pros": "\"The processes are the most valuable aspect of this solution.\"",
        "cons": "\"The most valuable features are the speed of reporting and the HANA database.\""
    },
    {
        "title": "Has good processes and offers many features that you can't get on-prem",
        "name": "FranciscoSantos",
        "pros": "\"It takes too long to escalate problems from the first level of support.\"",
        "cons": "\"The product is stable. \""
    },
    {
        "title": "Good reporting, well-suited for medium to large-sized organizations",
        "name": "Renaud Motuelle",
        "pros": "\"The solution is not scalable. It does not have a data streaming feature as well. \"",
        "cons": "\"The solution is easier to maintain than traditional SAP products.\""
    },
    {
        "title": "A stable solution with good technical support and easy setup",
        "name": "Venkata CH",
        "pros": "\"The solution does occasionally get a few bugs, but this is typical for any product.\"",
        "cons": "\"Some of the main features of this solution are that it uses HANA and it has good performance.\""
    },
    {
        "title": "Stable, scalable and easy to maintain",
        "name": "reviewer1292418",
        "pros": "\"Other competitors provide better solutions that are more up to date with current technology. \"",
        "cons": "\"The product has efficient performance.\n\n\""
    },
    {
        "title": "Stable, scalable, and good performance, but expensive",
        "name": "reviewer1477425",
        "pros": "\"The monitoring for the remodeling feature is very difficult to understand.\"",
        "cons": "\"The most valuable aspect of this solution is that the infrastructure is easy to understand. \""
    },
    {
        "title": "Has good scalability, but its monitoring features need improvement",
        "name": "reviewer1308417",
        "pros": "\"Pricing would be a good improvement. A lot of customers think that it's very expensive and especially support is very expensive. \"",
        "cons": "\"The most valuable feature is the dashboard.\n\""
    }
]